/**********************************************************************************
	基于jquery的省份、城市下拉列表联动函数，自带省份城市数据
	
	参数说明：
		provinceID：			省份控件id
		cityID：				城市控件id
		hiddenPid：				保存省份选定值的隐藏域
		hiddenCid：				保存城市选定值的隐藏域
		isShowNone：			是否在省份控件中显示“请选择”的选项
		isHiddenEmptyCityObj：	是否在初始状态隐藏城市选择控件
	
	用法：
		HTML：
		<select name='selProvince' id='selProvince'></select>
		<select name='selCity' id='selCity'></select>
		<input type='hidden' name='hidProvince' id='hidProvince' value='' /> <!-- 隐藏域用于设定已有的选定项 -->
		<input type='hidden' name='hidCity' id='hidCity' value='' />
		<script>
			BindProvince('selProvince','selCity','hidProvince','hidCity',true,false)
		</script>
	
	Author:LiShiLin@Gmail.Com
	CreateDate:2008-12-08
	Version:1.2
***********************************************************************************/
//绑定省份
//参数：
function BindProvince(provinceID,cityID,hiddenPid,hiddenCid,isShowNone,isHiddenEmptyCityObj)
{
	var province = $("#" + provinceID);
	var city = $("#" + cityID);
	var hidp = $("#" + hiddenPid);
	var hidc = $("#" + hiddenCid);
	//清空省份控件
	province.html("");
	//设置城市控件显隐
	if( isHiddenEmptyCityObj )
		city.hide();
	//设置初始项
	if( isShowNone )
		province.append("<option value='none'>== 请选择省份 ==</option>");
	//绑定省份数据
	for(var i=0;i<ProvinceList.length;i++){
		if(ProvinceList[i] != null){
			var html = "<option ";
			if(((hidp.val()==""||hidp.val()==null)&&i==0&&(!isShowNone)) || (hidp.val() == ProvinceList[i][1] || hidp.val() == ProvinceList[i][0])){
				html+="selected='selected' ";
				hidp.val(ProvinceList[i][1]);
				//if(!isShowNone&&!isHiddenEmptyCityObj){
				if(!isHiddenEmptyCityObj && hidc.val() != "" && hidc.val() != null){
					BindCity(cityID,hiddenCid,ProvinceList[i][0],false);
				}
			}
			html+="value='"+ProvinceList[i][0]+"'>"+ProvinceList[i][1]+"</option>";
			province.append(html);
		}
	}
	//省份绑定选择事件
	province.change(
		function(){
			var thisval = $(this).find("option:selected").val();
			if(thisval == "none"){
				city.html("");
				if(isHiddenEmptyCityObj)city.hide();
				hidp.val("");
				hidc.val("");
			}
			else{
				hidp.val($(this).find("option:selected").text());
				BindCity(cityID,hiddenCid,thisval,true);
			}
		}
	);
	//城市绑定选择事件
	city.change(
		function(){
			hidc.val($(this).find("option:selected").text());
		}
	);
}
//绑定城市
function BindCity(cityID,hiddenID,pv,isInit)
{
	var city = $("#"+cityID);
	var hidc = $("#"+hiddenID);
	var citylist = GetData(pv);
	if(citylist.length > 0)
	{
		city.show();
		city.html("");
		//绑定数据到城市控件
		for(var i=0;i<citylist.length;i++){
			if(citylist[i]!=null){
				var html="<option ";
				if(((hidc.val()==""||hidc.val()==null)&&i==0) || (hidc.val() == citylist[i][1]||hidc.val()==citylist[i][0])){
					html+="selected='selected' ";
					hidc.val(citylist[i][1]);
				}
				html+="value='"+citylist[i][0]+"'>" + citylist[i][1] + "</option>";
				city.append(html);
			}
		}
		if(isInit){
			hidc.val(citylist[0][1]);
		}
	}
}

var ProvinceList=[
["17","江西省"],
["1","广东省"],
["2","广西壮族自治区"],
["3","河南省"],
["4","北京市"],
["5","天津市"],
["6","上海市"],
["7","重庆市"],
["8","河北省"],
["9","山西省"],
["10","辽宁省"],
["11","吉林省"],
["12","黑龙江省"],
["13","江苏省"],
["14","浙江省"],
["15","安徽省"],
["16","福建省"],
["18","山东省"],
["19","湖北省"],
["20","湖南省"],
["21","甘肃省"],
["22","四川省"],
["23","贵州省"],
["24","海南省"],
["25","云南省"],
["26","青海省"],
["27","陕西省"],
["28","西藏自治区"],
["29","宁夏回族自治区"],
["30","新疆维吾尔自治区"],
["31","内蒙古自治区"],
["32","澳门特别行政区"],
["33","香港特别行政区"],
["34","台湾"],
];

var P1=[
["2","广州"],
["3","深圳"],
["4","珠海"],
["5","韶关"],
["6","清远"],
["7","肇庆"],
["8","云浮"],
["9","茂名"],
["10","湛江"],
["12","河源"],
["13","惠州"],
["14","东莞"],
["15","佛山"],
["16","中山"],
["17","江门"],
["18","阳江"],
["19","梅州"],
["20","潮州"],
["21","汕头"],
["22","揭阳"],
["23","汕尾"],
];
var P2=[
["24","百色"],
["25","河池"],
["26","柳州"],
["27","合山"],
["28","桂林"],
["29","贺州"],
["30","凭祥"],
["31","南宁"],
["32","贵港"],
["33","桂平"],
["34","梧州"],
["35","防城港"],
["36","钦州"],
["37","玉林"],
["38","北海"],
];
var P3=[
["40","安阳市"],
["41","鹤壁市"],
["42","焦作市"],
["43","开封市"],
["44","洛阳市"],
["45","南阳市"],
["46","平顶山市"],
["47","三门峡市"],
["48","商丘地区"],
["49","新乡市"],
["50","信阳市"],
["51","许昌市"],
["52","郑州市"],
["53","周口地区"],
["54","驻马店地区"],
["55","漯河市"],
["56","濮阳市"],
["57","孟州市"],
["58","济源市"],
];
var P4=[
["59","北京"],
["60","通县"],
["61","昌平"],
["62","大兴"],
["63","密云"],
["64","延庆"],
["65","顺义"],
["66","怀柔"],
["67","平台"],
];
var P5=[
["68","天津"],
["69","蓟县"],
["70","宝坻"],
["71","武清"],
["72","静海"],
["73","宁河"],
];
var P6=[
["74","上海"],
["75","上海县"],
["76","嘉定"],
["77","松江"],
["78","南汇"],
["79","奉贤"],
["80","川沙"],
["81","青浦"],
["82","崇明"],
["83","金山"],
];
var P7=[
["84","万县"],
["85","永川"],
["86","北碚"],
["87","巴县"],
["88","江北"],
["89","重庆"],
["90","涪陵"],
["91","石柱"],
["92","丰都"],
["93","南川"],
["94","城口"],
["95","巫溪"],
["96","奉节"],
["97","云阳"],
["98","忠县"],
["99","梁平"],
["100","开县"],
["101","大足"],
["102","荣昌"],
["103","壁山"],
["104","铜梁"],
["105","潼南"],
["106","合川"],
["107","江津"],
["108","双桥"],
["109","南桐"],
["110","长寿"],
["111","綦江"],
["112","黔江"],
["113","武隆"],
["114","垫江"],
["115","巫山"],
];
var P8=[
["116","石家庄市"],
["117","南宫市"],
["118","辛集市"],
["119","衡水市"],
["120","邢台市"],
["121","沙河市"],
["122","邯郸市"],
["123","武安市"],
["124","沧州市"],
["125","泊头市"],
["126","任丘市"],
["127","唐山市"],
["128","廊坊市"],
["129","秦皇岛市"],
["130","北戴河"],
["131","承德市"],
["132","保定市"],
["133","涿州市"],
["134","定州市"],
["135","高碑店市"],
["136","张家口市"],
];
var P9=[
["137","太原市"],
["138","古交市"],
["139","榆次市"],
["140","忻州市"],
["141","大同市"],
["142","朔州市"],
["143","临汾市"],
["144","侯马市"],
["145","运城市"],
["146","阳泉市"],
["147","长治市"],
["148","晋城市"],
];
var P10=[
["149","沈阳市"],
["150","辽阳市"],
["151","铁岭市"],
["152","开原市"],
["153","铁法市"],
["154","抚顺市"],
["155","鞍山市"],
["156","海城市"],
["157","营口市"],
["158","大连市"],
["159","瓦房店市"],
["160","本溪市"],
["161","丹东市"],
["162","锦州市"],
["163","凌海市"],
["164","北宁市"],
["165","葫芦岛市"],
["166","兴城市"],
["167","朝阳市"],
["168","北票市"],
["169","阜新市"],
["170","盘锦市"],
];
var P11=[
["171","长春"],
["172","九台"],
["173","扶余"],
["174","大安"],
["175","吉林"],
["176","桦甸"],
["177","延吉"],
["178","图们"],
["179","珲春"],
["180","龙井"],
["181","敦化"],
["182","通化"],
["183","集安"],
["184","浑江"],
["185","临江"],
["186","梅河口"],
["187","四平"],
["188","公主岭"],
["189","辽源"],
["190","白城"],
["191","洮南"],
["192","松原"],
];
var P12=[
["193","哈尔滨市"],
["194","齐齐哈尔市"],
["195","鹤岗市"],
["196","双鸭山市"],
["197","鸡西市"],
["198","大庆市"],
["199","伊春市"],
["200","牡丹江市"],
["201","佳木斯市"],
["202","七台河市"],
["203","黑河市"],
["204","绥化市"],
["205","大兴安岭地区"],
];
var P13=[
["206","南京市"],
["207","无锡市"],
["208","徐州市	"],
["209","常州市	"],
["210","苏州市"],
["211","南通市	"],
["212","连云港市"],
["213","淮安市	"],
["214","盐城市"],
["215","扬州市"],
["216","镇江市"],
["217","泰州市"],
["218","宿迁市"],
];
var P14=[
["219","杭州市"],
["220","宁波市"],
["221","温州市"],
["222","嘉兴市"],
["223","湖州市"],
["224","绍兴市"],
["225","金华市"],
["226","衢州市"],
["227","舟山市"],
["228","台州市"],
["229","丽水市"],
];
var P15=[
["230","合肥市"],
["231","芜湖市"],
["232","蚌埠市"],
["233","淮南市"],
["234","马鞍山市"],
["235","淮北市"],
["236","铜陵市"],
["237","安庆市"],
["238","黄山市"],
["239","滁州市"],
["240","阜阳市"],
["241","宿州市"],
["242","巢湖市"],
["243","六安市"],
["244","亳州市"],
["245","池州市"],
["246","宣城市"],
];
var P16=[
["247","福州市"],
["248","厦门市"],
["249","莆田市"],
["250","三明市"],
["251","泉州市"],
["252","漳州市"],
["253","南平市"],
["254","龙岩市"],
["255","宁德市"],
];
var P17=[
["256","南昌市"],
["257","景德镇市"],
["258","萍乡市"],
["259","九江市"],
["260","新余市"],
["261","鹰潭市"],
["262","赣州市"],
["263","吉安市"],
["264","宜春市"],
["265","抚州市"],
["266","上饶市"],
];
var P18=[
["267","济南市"],
["268","青岛市"],
["269","淄博市"],
["270","枣庄市"],
["271","东营市"],
["272","烟台市"],
["273","潍坊市"],
["274","济宁市"],
["275","泰安市"],
["276","威海市"],
["277","日照市"],
["278","莱芜市"],
["279","临沂市"],
["280","德州市"],
["281","聊城市"],
["282","滨州市"],
["283","菏泽市"],
];
var P19=[
["284","武汉市"],
["285","黄石市"],
["286","十堰市"],
["287","荆州市"],
["288","宜昌市"],
["289","襄樊市"],
["290","鄂州市"],
["291","荆门市"],
["292","孝感市"],
["293","黄冈市"],
["294","咸宁市"],
["295","随州市"],
["296","仙桃市"],
["297","天门市"],
["298","潜江市"],
["299","神农架林区"],
["300","恩施土家族苗族自治州"],
];
var P20=[
["301","长沙市"],
["302","株洲市"],
["303","湘潭市"],
["304","衡阳市"],
["305","邵阳市"],
["306","岳阳市"],
["307","常德市"],
["308","张家界市"],
["309","益阳市"],
["310","郴州市"],
["311","永州市"],
["312","怀化市"],
["313","娄底市"],
["314","湘西土家族苗族自治州"],
];
var P21=[
["315","兰州市"],
["316","金昌市"],
["317","白银市"],
["318","天水市"],
["319","嘉峪关市"],
["320","武威市"],
["321","张掖市"],
["322","平凉市"],
["323","酒泉市"],
["324","庆阳市"],
["325","定西市"],
["326","陇南市"],
["327","临夏回族自治州"],
["328","甘南藏族自治州"],
];
var P22=[
["329","成都市"],
["330","自贡市"],
["331","攀枝花市"],
["332","泸州市"],
["333","德阳市"],
["334","绵阳市"],
["335","广元市"],
["336","遂宁市"],
["337","内江市"],
["338","乐山市"],
["339","南充市"],
["340","眉山市"],
["341","宜宾市"],
["342","广安市"],
["343","达州市"],
["344","雅安市"],
["345","巴中市"],
["346","资阳市"],
["347","阿坝藏族羌族自治州"],
["348","甘孜藏族自治州"],
["349","凉山彝族自治州"],
];
var P23=[
["350","贵阳市"],
["351","六盘水市"],
["352","遵义市"],
["353","安顺市"],
["354","铜仁地区"],
["355","毕节地区"],
["356","黔西南布依族苗族自治州"],
["357","黔东南苗族侗族自治州"],
["358","黔南布依族苗族自治州"],
];
var P24=[
["359","海口市"],
["360","三亚市"],
["361","五指山市"],
["362","琼海市"],
["363","儋州市"],
["364","文昌市"],
["365","万宁市"],
["366","东方市"],
["367","澄迈县"],
["368","定安县"],
["369","屯昌县"],
["370","临高县"],
["371","白沙黎族自治县"],
["372","昌江黎族自治县"],
["373","乐东黎族自治县"],
["374","陵水黎族自治县"],
["375","保亭黎族苗族自治县"],
["376","琼中黎族苗族自治县"],
];
var P25=[
["377","昆明市"],
["378","曲靖市"],
["379","玉溪市"],
["380","保山市"],
["381","昭通市"],
["382","丽江市"],
["383","思茅市"],
["384","临沧市"],
["385","文山壮族苗族自治州"],
["386","红河哈尼族彝族自治州"],
["387","西双版纳傣族自治州"],
["388","楚雄彝族自治州"],
["389","大理白族自治州"],
["390","德宏傣族景颇族自治州"],
["391","怒江傈傈族自治州"],
["392","迪庆藏族自治州"],
];
var P26=[
["393","西宁市"],
["394","海东地区"],
["395","海北藏族自治州"],
["396","黄南藏族自治州"],
["397","海南藏族自治州"],
["398","果洛藏族自治州"],
["399","玉树藏族自治州"],
["400","海西蒙古族藏族自治州"],
];
var P27=[
["401","西安市"],
["402","铜川市"],
["403","宝鸡市"],
["404","咸阳市"],
["405","渭南市"],
["406","延安市"],
["407","汉中市"],
["408","榆林市"],
["409","安康市"],
["410","商洛市"],
];
var P28=[
["411","拉萨市"],
["412","那曲地区"],
["413","昌都地区"],
["414","山南地区"],
["415","日喀则地区"],
["416","阿里地区"],
["417","林芝地区"],
];
var P29=[
["418","银川市"],
["419","石嘴山市"],
["420","吴忠市"],
["421","固原市"],
["422","中卫市"],
];
var P30=[
["423","乌鲁木齐市"],
["424","克拉玛依市"],
["425","石河子市"],
["426","阿拉尔市"],
["427","图木舒克市"],
["428","五家渠市"],
["429","吐鲁番市"],
["430","阿克苏市"],
["431","喀什市"],
["432","哈密市"],
["433","和田市"],
["434","阿图什市"],
["435","库尔勒市"],
["436","昌吉市"],
["437","阜康市"],
["438","米泉市"],
["439","博乐市"],
["440","伊宁市"],
["441","奎屯市"],
["442","塔城市"],
["443","乌苏市"],
];
var P31=[
["444","阿勒泰市"],
["445","呼和浩特市"],
["446","包头市"],
["447","乌海市"],
["448","赤峰市"],
["449","通辽市"],
["450","鄂尔多斯市"],
["451","呼伦贝尔市"],
["452","巴彦淖尔市"],
["453","乌兰察布市"],
["454","锡林郭勒盟"],
["455","兴安盟"],
["456","阿拉善盟"],
];
var P32=[
["457","澳门特别行政区"],
];
var P33=[
["458","香港特别行政区"],
];
var P34=[
["460","台北市"],
];

function GetData(pid)
{
	switch(pid)
	{
		case "1":return P1;
		case "2":return P2;
		case "3":return P3;
		case "4":return P4;
		case "5":return P5;
		case "6":return P6;
		case "7":return P7;
		case "8":return P8;
		case "9":return P9;
		case "10":return P10;
		case "11":return P11;
		case "12":return P12;
		case "13":return P13;
		case "14":return P14;
		case "15":return P15;
		case "16":return P16;
		case "17":return P17;
		case "18":return P18;
		case "19":return P19;
		case "20":return P20;
		case "21":return P21;
		case "22":return P22;
		case "23":return P23;
		case "24":return P24;
		case "25":return P25;
		case "26":return P26;
		case "27":return P27;
		case "28":return P28;
		case "29":return P29;
		case "30":return P30;
		case "31":return P31;
		case "32":return P32;
		case "33":return P33;
		case "34":return P34;
	}
}